# Αυτό είναι το Makefile. Σκοπός του είναι να μας βοηθάει να φτιάχνουμε το πρόγραμμα εύκολα.
# Αντί να γράφουμε μακροσκελείς εντολές, απλά γράφουμε "make".

CC = gcc        # Ο μεταγλωττιστής που χρησιμοποιούμε (gcc για C).
CFLAGS = -Wall  # Ενεργοποιούμε προειδοποιήσεις για λάθη στον κώδικα.
TARGET = program # Το όνομα του τελικού εκτελέσιμου προγράμματος.

# Η εντολή που φτιάχνει το πρόγραμμα. 
# Με το "make", μεταγλωττίζουμε το main.c σε ένα εκτελέσιμο που λέγεται "program".
all: $(TARGET)

$(TARGET): main.o
	$(CC) $(CFLAGS) -o $(TARGET) main.o

# Εδώ φτιάχνουμε το αρχείο main.o από το main.c.
main.o: main.c functions.h
	$(CC) $(CFLAGS) -c main.c

# Η εντολή "make clean" διαγράφει τα αρχεία που φτιάξαμε (π.χ. εκτελέσιμα).
clean:
	rm -f $(TARGET) *.o

